In [9]:
import pandas as pd
import numpy as np
from scipy.stats import zscore
import seaborn as sns
import matplotlib.pyplot as plt

In [11]:
df_ratings = pd.read_csv("BX-Book-Ratings.csv", sep=";", encoding='ISO-8859–1',low_memory=False)
df_books = pd.read_csv("BX-Books.csv", sep=";", encoding='ISO-8859–1', on_bad_lines='skip',low_memory=False)
df_users = pd.read_csv("BX-Users.csv", sep=";", encoding='ISO-8859–1',low_memory=False)

In [12]:
df_ratings

         User-ID         ISBN  Book-Rating
0         276725   034545104X            0
1         276726   0155061224            5
2         276727   0446520802            0
3         276729   052165615X            3
4         276729   0521795028            6
...          ...          ...          ...
1149775   276704   1563526298            9
1149776   276706   0679447156            0
1149777   276709   0515107662           10
1149778   276721   0590442449           10
1149779   276723  05162443314            8

[1149780 rows x 3 columns]

In [13]:
#df_books.drop(["Image-URL-S", "Image-URL-M", "Image-URL-L"], axis=1, inplace=True)

## Describe Datasets

In [14]:
print(df_ratings.dtypes)
print("--------------------------------")
print(df_books.dtypes)
print("--------------------------------")
print(df_users.dtypes)
print("--------------------------------")

User-ID         int64
ISBN           object
Book-Rating     int64
dtype: object
--------------------------------
ISBN                   object
Book-Title             object
Book-Author            object
Year-Of-Publication    object
Publisher              object
Image-URL-S            object
Image-URL-M            object
Image-URL-L            object
dtype: object
--------------------------------
User-ID       int64
Location     object
Age         float64
dtype: object
--------------------------------

In [15]:
print(df_ratings.shape)
print(df_ratings.describe())
df_ratings.head()

(1149780, 3)
            User-ID   Book-Rating
count  1.149780e+06  1.149780e+06
mean   1.403864e+05  2.866950e+00
std    8.056228e+04  3.854184e+00
min    2.000000e+00  0.000000e+00
25%    7.034500e+04  0.000000e+00
50%    1.410100e+05  0.000000e+00
75%    2.110280e+05  7.000000e+00
max    2.788540e+05  1.000000e+01

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [16]:
print(df_books.shape)
print(df_books.describe())
df_books.head()

(271360, 8)
              ISBN      Book-Title      Book-Author Year-Of-Publication  \
count       271360          271360           271359              271360
unique      271360          242135           102023                 118
top     0195153448  Selected Poems  Agatha Christie                2002
freq             1              27              632               17627

        Publisher                                        Image-URL-S  \
count      271358                                             271360
unique      16807                                             271044
top     Harlequin  http://images.amazon.com/images/P/185326119X.0...
freq         7535                                                  2

                                              Image-URL-M  \
count                                              271360
unique                                             271044
top     http://images.amazon.com/images/P/185326119X.0...
freq                                                    2

                                              Image-URL-L
count                                              271357
unique                                             271041
top     http://images.amazon.com/images/P/225307649X.0...
freq                                                    2

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [17]:
print(df_users.shape)
print(df_users.describe())
df_users.head()

(278858, 3)
            User-ID            Age
count  278858.00000  168096.000000
mean   139429.50000      34.751434
std     80499.51502      14.428097
min         1.00000       0.000000
25%     69715.25000      24.000000
50%    139429.50000      32.000000
75%    209143.75000      44.000000
max    278858.00000     244.000000

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

## Book Popularity , Author Popularity

In [18]:
df_ratings.sort_values("Book-Rating", ascending=False)

        User-ID        ISBN  Book-Rating
714920   173291  0590460609           10
439695   105221  0590353403           10
439659   105214  1573220221           10
113491    26421  1558743669           10
439664   105221  0064407667           10
...         ...         ...          ...
484342   115120  0671026852            0
484343   115120  0671026860            0
484344   115120  0671027514            0
484345   115120  0671027522            0
574890   138366  0373764391            0

[1149780 rows x 3 columns]

In [19]:
df_ratings_grouped = df_ratings.groupby("ISBN")[["ISBN", "Book-Rating"]].mean().reset_index()

In [20]:
df_ratings_grouped.sort_values("Book-Rating", ascending=False )

              ISBN  Book-Rating
226259  0874477050         10.0
311209   561002010         10.0
147976  0590939874         10.0
261695  1570761914         10.0
311223   56500624X         10.0
...            ...          ...
224180  0866838937          0.0
224181  0866839070          0.0
224182  0866839100          0.0
224183  0866839453          0.0
97853   0439216397          0.0

[340556 rows x 2 columns]

In [21]:
df_merged1 = df_books.merge(df_ratings_grouped, left_on="ISBN", right_on="ISBN", how="inner")

In [22]:
for col in df_merged1.columns:
    print(col,df_merged1[col].isna().sum())

ISBN 0
Book-Title 0
Book-Author 1
Year-Of-Publication 0
Publisher 2
Image-URL-S 0
Image-URL-M 0
Image-URL-L 3
Book-Rating 0

In [23]:
df_merged1[["Book-Author", "Book-Rating"]].sort_values("Book-Rating", ascending=False)

                        Book-Author  Book-Rating
127129                 Richard Bach         10.0
125450             Harry Turtledove         10.0
125460                    Lisa Cach         10.0
125461    ReShonda Tate Billingsley         10.0
125462             Michael Moorcock         10.0
...                             ...          ...
145590                 Berta Platas          0.0
145592                Yolo McClaney          0.0
145593                Kyle Roderick          0.0
145595  Lidia Matticchio Bastianich          0.0
270150          Christopher  Biffle          0.0

[270151 rows x 2 columns]

In [25]:
df_merged1['ISBN'].duplicated().any()

False

In [26]:
df_merged2 = df_users.merge(df_ratings, left_on="User-ID", right_on="User-ID", how="inner")

In [27]:
df_merged2

         User-ID                   Location   Age        ISBN  Book-Rating
0              2  stockton, california, usa  18.0  0195153448            0
1              7        washington, dc, usa   NaN   034542252            0
2              8   timmins, ontario, canada   NaN  0002005018            5
3              8   timmins, ontario, canada   NaN  0060973129            0
4              8   timmins, ontario, canada   NaN  0374157065            0
...          ...                        ...   ...         ...          ...
1149775   278854      portland, oregon, usa   NaN  0425163393            7
1149776   278854      portland, oregon, usa   NaN  0515087122            0
1149777   278854      portland, oregon, usa   NaN  0553275739            6
1149778   278854      portland, oregon, usa   NaN  0553578596            0
1149779   278854      portland, oregon, usa   NaN  0553579606            8

[1149780 rows x 5 columns]

In [28]:
age_mean = np.round(df_merged2["Age"].mean(),0)

In [29]:
df_merged2["Age"].fillna(-2, inplace=True)

In [30]:
df_merged2.drop(["Location"], axis=1, inplace=True)

In [31]:
for col in df_merged2.columns:
    print(df_merged2[col].isna().sum())

0
0
0
0

In [32]:
bins=[-2,-1,10,18,30,60,100]
labels = ["Unknown Age", 'Kid (0-10)','Teenager (11-18)','Adult (19-30)','Midle-Age (31-60)','Elderly (61-100)']
df_merged2['AgeGroup'] = pd.cut(df_merged2['Age'], bins=bins, labels=labels, right=False)

In [33]:
df_merged2

         User-ID   Age        ISBN  Book-Rating       AgeGroup
0              2  18.0  0195153448            0  Adult (19-30)
1              7  -2.0   034542252            0    Unknown Age
2              8  -2.0  0002005018            5    Unknown Age
3              8  -2.0  0060973129            0    Unknown Age
4              8  -2.0  0374157065            0    Unknown Age
...          ...   ...         ...          ...            ...
1149775   278854  -2.0  0425163393            7    Unknown Age
1149776   278854  -2.0  0515087122            0    Unknown Age
1149777   278854  -2.0  0553275739            6    Unknown Age
1149778   278854  -2.0  0553578596            0    Unknown Age
1149779   278854  -2.0  0553579606            8    Unknown Age

[1149780 rows x 5 columns]

In [34]:
df_age_ranges = df_merged2.groupby("AgeGroup").count().reset_index()

In [35]:
df_age_ranges.drop(["Age", "User-ID"], axis=1, inplace=True)

In [36]:
df_age_ranges.rename(columns={"ISBN": "Book Count"}, inplace = True)

In [37]:
df_age_ranges.sort_values("Book Count", ascending=False)

            AgeGroup  Book Count  Book-Rating
4  Midle-Age (31-60)      541272       541272
0        Unknown Age      309492       309492
3      Adult (19-30)      231345       231345
5   Elderly (61-100)       38348        38348
2   Teenager (11-18)       20045        20045
1         Kid (0-10)        5736         5736

In [38]:
df_merged3 = df_merged2.merge(df_books, left_on="ISBN", right_on="ISBN", how="inner")

In [39]:
df_merged3.drop(["Image-URL-S",
                 "Image-URL-M",
                 "Image-URL-L",
                 "Year-Of-Publication",
                "Publisher"], axis=1, inplace=True)

In [40]:
df_merged3.columns

Index(['User-ID', 'Age', 'ISBN', 'Book-Rating', 'AgeGroup', 'Book-Title',
       'Book-Author'],
      dtype='object')

In [41]:
df_cleaned_aged = df_merged3[(df_merged3.Age >0) & (df_merged3.Age <100)]

In [42]:
df_cleaned_rating = df_cleaned_aged[df_cleaned_aged["Book-Rating"]>0]

In [43]:
df_cleaned_rating = df_cleaned_rating[df_cleaned_rating['Book-Author'].notna()]

In [44]:
df_cleaned_rating

,User-ID,Age,ISBN,Book-Rating,AgeGroup,Book-Title,Book-Author
5,67544,30.0,0002005018,8,Midle-Age (31-60),Clara Callan,Richard Bruce Wright
13,219008,60.0,0002005018,7,Elderly (61-100),Clara Callan,Richard Bruce Wright
14,263325,27.0,0002005018,6,Adult (19-30),Clara Callan,Richard Bruce Wright
16,2954,71.0,0060973129,8,Elderly (61-100),Decision in Normandy,Carlo D'Este
17,152827,40.0,0060973129,7,Midle-Age (31-60),Decision in Normandy,Carlo D'Este
...,...,...,...,...,...,...,...
1031130,278851,33.0,067161746X,7,Midle-Age (31-60),The Bachelor Home Companion: A Practical Guide...,P.J. O'Rourke
1031132,278851,33.0,0767907566,5,Midle-Age (31-60),All Elevations Unknown: An Adventure in the He...,Sam Lightner
1031133,278851,33.0,0884159221,7,Midle-Age (31-60),Why stop?: A guide to Texas historical roadsid...,Claude Dooley
1031134,278851,33.0,0912333022,7,Midle-Age (31-60),The Are You Being Served? Stories: 'Camping In...,Jeremy Lloyd
1031135,278851,33.0,1569661057,10,Midle-Age (31-60),"Dallas Street Map Guide and Directory, 2000 Ed...",Mapsco

In [45]:
df_count_read_books = df_cleaned_rating.groupby("ISBN")[["Book-Rating"]].count()

In [46]:
df_count_read_books = df_count_read_books[df_count_read_books['Book-Rating'] !=1]

In [47]:
df_zscore = df_count_read_books.apply(zscore)

In [50]:
df_zscore_cleaned = df_zscore[df_zscore['Book-Rating']<3]

In [51]:
print(df_zscore_cleaned['Book-Rating'].max())
print(df_zscore['Book-Rating'].min())

2.99213006278261
-0.3141661879883812

In [52]:
idx = df_zscore_cleaned.index.values

In [53]:
df_final = df_cleaned_rating[df_cleaned_rating["ISBN"].isin(idx)]

In [54]:
df_final.reset_index(drop=True, inplace=True)

In [55]:
df_final

,User-ID,Age,ISBN,Book-Rating,AgeGroup,Book-Title,Book-Author
0,67544,30.0,0002005018,8,Midle-Age (31-60),Clara Callan,Richard Bruce Wright
1,219008,60.0,0002005018,7,Elderly (61-100),Clara Callan,Richard Bruce Wright
2,263325,27.0,0002005018,6,Adult (19-30),Clara Callan,Richard Bruce Wright
3,2954,71.0,0060973129,8,Elderly (61-100),Decision in Normandy,Carlo D'Este
4,152827,40.0,0060973129,7,Midle-Age (31-60),Decision in Normandy,Carlo D'Este
...,...,...,...,...,...,...,...
153759,272482,40.0,1853045616,10,Midle-Age (31-60),The Xenophobe's Guide to the Germans,Stephan Ziedenitz
153760,272715,31.0,0312273150,10,Midle-Age (31-60),All About All About Eve: The Complete Behind-T...,Sam Staggs
153761,276263,33.0,0312273150,5,Midle-Age (31-60),All About All About Eve: The Complete Behind-T...,Sam Staggs
153762,275383,43.0,0679449132,8,Midle-Age (31-60),Virtuous Reality: How America Surrendered Disc...,Jon Katz
153763,275737,54.0,0679449132,5,Midle-Age (31-60),Virtuous Reality: How America Surrendered Disc...,Jon Katz

In [56]:
df_final.to_csv('df_final.csv', index = False)